Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71N19.PIC
      <edc:SFRDef edc:_addr="0x4006C004" edc:access="--nnnnnnnnnn-nnnnnnnnnnnnnnnn-nn" edc:cname="AES_MR" edc:impl="0x3FF7FFFB" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="CIPHER" edc:desc="Processing Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GTAGEN" edc:desc="GCM Automatic Tag Generation Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DUALBUFF" edc:desc="Dual Input Buffer" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="INACTIVE" edc:desc="AES_IDATARx cannot be written during processing of previous block." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="AES_IDATARx can be written during processing of previous block when SMOD = 2. It speeds up the overall runtime of large files." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PROCDLY" edc:desc="Processing Delay" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SMOD" edc:desc="Start Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MANUAL_START" edc:desc="Manual Mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AUTO_START" edc:desc="Auto Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IDATAR0_START" edc:desc="AES_IDATAR0 access only Auto Mode (DMA)" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="KEYSIZE" edc:desc="Key Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="AES128" edc:desc="AES Key Size is 128 bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AES192" edc:desc="AES Key Size is 192 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AES256" edc:desc="AES Key Size is 256 bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:desc="Operating Mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="ECB" edc:desc="ECB: Electronic Code Book mode" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CBC" edc:desc="CBC: Cipher Block Chaining mode" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFB" edc:desc="OFB: Output Feedback mode" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CFB" edc:desc="CFB: Cipher Feedback mode" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CTR" edc:desc="CTR: Counter mode (16-bit internal counter)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCM" edc:desc="GCM: Galois/Counter mode" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LOD" edc:desc="Last Output Data Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFBS" edc:desc="Cipher Feedback Data Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SIZE_128BIT" edc:desc="128-bit" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_64BIT" edc:desc="64-bit" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_32BIT" edc:desc="32-bit" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_16BIT" edc:desc="16-bit" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_8BIT" edc:desc="8-bit" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CKEY" edc:desc="Countermeasure Key" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="This field must be written with 0xE to allow CMTYPx bit configuration changes. Any other values will abort the write operation in CMTYPx bits.Always reads as 0." edc:when="(field &amp; 0xF) == 0xE"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMTYP1" edc:desc="Countermeasure Type 1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOPROT_EXTKEY" edc:desc="Countermeasure type 1 is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROT_EXTKEY" edc:desc="Countermeasure type 1 is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMTYP2" edc:desc="Countermeasure Type 2" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_PAUSE" edc:desc="Countermeasure type 2 is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PAUSE" edc:desc="Countermeasure type 2 is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMTYP3" edc:desc="Countermeasure Type 3" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_DUMMY" edc:desc="Countermeasure type 3 is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DUMMY" edc:desc="Countermeasure type 3 is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMTYP4" edc:desc="Countermeasure Type 4" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_RESTART" edc:desc="Countermeasure type 4 is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RESTART" edc:desc="Countermeasure type 4 is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMTYP5" edc:desc="Countermeasure Type 5" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_ADDACCESS" edc:desc="Countermeasure type 5 is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ADDACCESS" edc:desc="Countermeasure type 5 is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMTYP6" edc:desc="Countermeasure Type 6" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_IDLECURRENT" edc:desc="Countermeasure type 6 is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IDLECURRENT" edc:desc="Countermeasure type 6 is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4006C008" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4006C010" edc:access="---------------w-------w-------w" edc:cname="AES_IER" edc:impl="0x10101" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:desc="Data Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Unspecified Register Access Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TAGRDY" edc:desc="GCM Tag Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C014" edc:access="---------------w-------w-------w" edc:cname="AES_IDR" edc:impl="0x10101" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:desc="Data Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Unspecified Register Access Detection Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TAGRDY" edc:desc="GCM Tag Ready Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C018" edc:access="---------------r-------r-------r" edc:cname="AES_IMR" edc:impl="0x10101" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:desc="Data Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Unspecified Register Access Detection Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TAGRDY" edc:desc="GCM Tag Ready Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C01C" edc:access="---------------rrrrr---r-------r" edc:cname="AES_ISR" edc:impl="0x1F101" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:desc="Data Ready (cleared by setting bit START or bit SWRST in AES_CR or by reading AES_ODATARx)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Unspecified Register Access Detection Status (cleared by writing SWRST in AES_CR)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="URAT" edc:desc="Unspecified Register Access (cleared by writing SWRST in AES_CR)" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="IDR_WR_PROCESSING" edc:desc="Input Data register written during the data processing when SMOD = 0x2 mode." edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ODR_RD_PROCESSING" edc:desc="Output Data register read during the data processing." edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MR_WR_PROCESSING" edc:desc="Mode register written during the data processing." edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ODR_RD_SUBKGEN" edc:desc="Output Data register read during the sub-keys generation." edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MR_WR_SUBKGEN" edc:desc="Mode register written during the sub-keys generation." edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="WOR_RD_ACCESS" edc:desc="Write-only register read access." edc:when="(field &amp; 0xF) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TAGRDY" edc:desc="GCM Tag Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
